#include <stdio.h>
#include <stdlib.h>
/*Задание: сделать упорядоченный набор элементов на массиве
Перечень операций:
	получение элемента по индексу;
	принадлежность элемента вектору
	изменение элемента;
	арифметические операции над векторами: поэлементное
		сложение, вычитание, умножение, деление;
	операции определения нижней и верхней границ индекса;
	размер вектора;
	инициализация вектора и его очистка;
	слияние векторов
	случайное заполнение структуры данных;
	заполнение из файла;
	сохранение структуры в файл;
	необходимо уметь обосновать выбранные размеры переменных
		и временных буферов.
*/

int main(void) {
	puts("Hello World!");
	return EXIT_SUCCESS;
}
